{"data":{"markdownRemark":{"html":"<h2>better late than never...</h2>\n<p>I think it's safe to say McHacks wasn't lying when they said they were Canada's \"everything\" Hackathon (though I hear Hack the North is pretty great too!).  There was a ton of great sponsors, homemade cookies, awesome stickers, and incredibly tasty poutine.  It was also just interesting to be in Montreal.  I had never been in another country until McHacks, and it was totally worth the six hour drive through the Great White North of upstate New York.</p>\n<p>I attempted to make a web app with one of my friends.  It was really the first time I had tried any serious backend work, using Express and MongoDB.  For me it was a crash course in the practical uses of HTTP and JSON.  For my friend it was a crash course in templating languages and the Bootstrap framework.  Bootstrap will always have a special place in my heart.  It simplifies responsive design so much that it's really hard to complain that \"every bootstrap site looks the same\".  </p>\n<p>It was my first time traveling outside the United States so and I was definitely looked like a tourist.  Most of it had to do with my inability to pay for things normally.  I asked a  convenience store clerk if I could pay with US dollars and he sighed and begrudgingly accepted payment for the pile of candy I bought.  (They have dark chocolate kit kat's!)  He gave me Canadian money back as change, which was all coins.  Then we went to a coffee shop where I skeptically asked if I could pay for my coffee using the strange coins the convenience store clerk gave me.  She looked at me funny, and a little concerned, and said that the money I gave her was perfectly ok.  Then she gave my a quick lesson on Canadian currency.  If McHacks had an award for Most Oblivious American, I would have won it.      </p>\n<p>Long story short we made a half working to do list app.  We ran into issues with loading and storing the task lists that we were using.  We did solve a lot of other issues though, like generating custom urls for each list, and storing and loading individual tasks.  Now that the fog of poutine and Tim Horton's has passed I think I know how to fix it.  Sometime in the near future I think I'll go and fix all my broken code.      </p>","frontmatter":{"title":"McHacks","date":"2015-02-27"}}},"pageContext":{"slug":"/2015-02-27-McHacks/"}}