{"data":{"allMarkdownRemark":{"totalCount":8,"edges":[{"node":{"id":"a1c59e23-d33a-5d4c-a3bf-cf80697c3c09","frontmatter":{"title":"Data Vuesualization - Data Visualization in Vue","date":"March 20, 2019"},"fields":{"slug":"/Data-Vuesualization/Data-Vuesualization/"},"excerpt":"This is a presentation I gave for the  VueNYC  Meetup on March 19th. It goes into the basic concepts of Data Visualization. Then I go over how to create readable charts in Vue with Vue and ChartJS."}},{"node":{"id":"4de5b501-e4f1-56e7-8da5-009079ad8564","frontmatter":{"title":"A Hitchhiker’s Guide to Chrome Extension Development","date":"January 14, 2019"},"fields":{"slug":"/Chrome-Extensions/Hitchhikers-Guide-To-Chrome/"},"excerpt":"The Chrome Extensions API’s have surprisingly good documentation, but there’s no real “recipes” section. They give you all the parts you need then say “go have fun”. So this post will go through some of the rough edges I ran into when I started working on a Chrome extension. For security, Chrome heavily sandboxes all its extension code. You use  messages  to communicate with disparate pieces of code.  Chrome extension api’s are also event based, such as browser actions or  devtools There’s two main types of Chrome scripts,  content scripts  and  background scripts .  Background scripts  run…"}},{"node":{"id":"49c35b7b-4bf3-5d10-a9c8-ef0d38894568","frontmatter":{"title":"SBCS Flask Tutorial","date":"February 25, 2016"},"fields":{"slug":"/Flask-tutorial/2016-02-25-Flask-Tutorial/"},"excerpt":"SBCS Web Tutorial  In this tutorial we will be making a rotating photo gallery, similar to a digital picture frame.  We will be using the Flask framework, Python, jQuery, Bootstrap, and hosting our app on Microsoft's Azure cloud service.    Let's start at the beginning. How the Web Works  Most connections on websites are transmitted using the Hypertext Transfer Protocol (HTTP). A    client sends HTTP  requests  to a server and the server responds with an HTTP  response .  Flask is a python framework that allows us to write a web server to communicate with our client (the web browser) using…"}},{"node":{"id":"32c7d4d6-3bd5-58e2-a5d0-09d142354dd5","frontmatter":{"title":"On Creating Something Real","date":"January 13, 2016"},"fields":{"slug":"/On-Creativity/2016-01-13-On-Creativity/"},"excerpt":"I recently submitted my first app to the Pebble smartwatch app store.  This is the first time I've made something that other people can use and download.  I've made a lot of smaller projects before, but nothing that was polished enough that I felt others should use it.   About a year ago I made a goal to make larger projects, projects that people would actually want to use.  I've made a lot of \"toy projects\", small projects that I used to teach me a technology.  I wanted to get away from this habit, I want to make things that I'm proud of and I want to use.  Clicking the button to submit my…"}},{"node":{"id":"8fe885e4-18fb-56b4-843e-2f1598245cdc","frontmatter":{"title":"Make a Web 2.0 Turkey with HTML5 Canvas","date":"November 18, 2015"},"fields":{"slug":"/HTML5-Turkey/2015-11-18-HTML5-Turkey/"},"excerpt":"Intro The Hand Turkey The Hand Turkey is a long fabled Thanksgiving tradition.  Elementary school students around the  world  United States trace their hands as part of an ~~ ancient pagan ceremony ~~ art class.  We decided to bring this age old tradition into the twenty first century by making the classic turkey with HTML5 canvas and javascript. What's HTML5 Canvas? The  canvas  element is a special tag in HTML.  It creates a media object, similar to an image.  You can change the width and height properties, just like an  img  tag.  The canvas is special because of what it can do.  It is…"}},{"node":{"id":"aad268f2-da56-51d6-98b1-f9306b56b1f6","frontmatter":{"title":"Bitcamp","date":"April 15, 2015"},"fields":{"slug":"/Bitcamp/2015-04-15-BitCamp/"},"excerpt":"aka the never ending bus ride part one and two It was one of those days that just felt gloomy. Clouds filled the sky and blocked the sun and there a slight drizzle, just enough to be annoying. The Stony Brook Computing Society waited at the train station for the bus to arrive to take us to Maryland. It was supposed to arrive at 1pm, at around 1:30pm the bus driver called and told us he was lost on the LIE. After another hour of directions delivered via phone calls, the buses arrived at Stony Brook. To make this situation funnier some of us had convinced our professor to hold a quiz early…"}},{"node":{"id":"0174fc3e-d01c-556f-b08a-5d48d13404b9","frontmatter":{"title":"McHacks","date":"February 27, 2015"},"fields":{"slug":"/McHacks/2015-02-27-McHacks/"},"excerpt":"better late than never... I think it's safe to say McHacks wasn't lying when they said they were Canada's \"everything\" Hackathon (though I hear Hack the North is pretty great too!).  There was a ton of great sponsors, homemade cookies, awesome stickers, and incredibly tasty poutine.  It was also just interesting to be in Montreal.  I had never been in another country until McHacks, and it was totally worth the six hour drive through the Great White North of upstate New York. I attempted to make a web app with one of my friends.  It was really the first time I had tried any serious backend work…"}},{"node":{"id":"51dea9ac-95d6-51e1-999f-82c277123af0","frontmatter":{"title":"Asynchronous Communication","date":"February 15, 2015"},"fields":{"slug":"/Asynchronous-Communication/2015-02-15-Asynchronous-Communication/"},"excerpt":"Texting, Email, Facebook messages, Tweets, all of our communication is asynchronous, like passing someone a note and hoping they pass it back. There's a reason texting took off so rapidly as the  main form of communication .  It's discrete, you can text during a meeting or in a class much easier than taking a phone call.  Texting also feeds into the desire for immediacy that people crave.  A text is sent quickly and answered quickly.  Seeing the little speech bubble showing the other person typing gives us satisfaction-\"any minute know I'll have my answer\".  While texting is usually immediate…"}}]}},"pageContext":{}}