{"data":{"markdownRemark":{"html":"<h1>Intro</h1>\n<h2>The Hand Turkey</h2>\n<p>The Hand Turkey is a long fabled Thanksgiving tradition.  Elementary school students around the <del>world</del> United States trace their hands as part of an ~~ ancient pagan ceremony ~~ art class.  We decided to bring this age old tradition into the twenty first century by making the classic turkey with HTML5 canvas and javascript.</p>\n<h2>What's HTML5 Canvas?</h2>\n<p>The <em>canvas</em> element is a special tag in HTML.  It creates a media object, similar to an image.  You can change the width and height properties, just like an <em>img</em> tag.  The canvas is special because of what it can do.  It is essentially a blank, well, canvas for you to draw on.  You can use Javascript to manipulate it to add stylized text, shapes, images, and much more.  In this tutorial we will use the canvas to draw shapes to make a turkey.</p>\n<h2>Additional Resources</h2>\n<p>There are some very helpful resources on the HTML5 canvas on the world wide web:</p>\n<ul>\n<li><a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Canvas_API\">Mozilla Developer Network</a></li>\n<li><a href=\"http://www.w3schools.com/html/html5_canvas.asp\">W3 Schools</a></li>\n<li><a href=\"http://code.tutsplus.com/series/canvas-from-scratch--net-19650\">TutsPlus</a></li>\n</ul>\n<h1>Part 1 - Setup</h1>\n<p>To start we're going to make a new folder.  You can call it \"turkey\" or something.  Inside that folder we will make two files - <strong>turkey.html</strong> and <strong>main.js</strong> .  turkey.html will be the main page of that will have a canvas element and the html markup.  Let's make the <em>canvas</em> element 500x500.  main.js will hold all the javascript, here we will write the code for creating the shapes on the canvas.  We will link main.js to turkey.html by adding a <em>script</em> tag to the head of turkey.html.  </p>\n<p>Here's what the turkey.html should look like after you make the canvas element and link the main.js javascript file.</p>\n<p>{% highlight html %}</p>\n<!DOCTYPE html>\n<html>\n<head>\n\t<title>Thanksgiving Turkey</title>\n\t<script type = \"text/javascript\" src = \"./main.js\"></script>\n</head>\n<body>\n<canvas width = \"500\" height = \"500\">\nThanksgiving turkey goes here.\n</canvas>\n</body>\n{% endhighlight %}\n<p>Now we turn our attention to main.js.  Before we can do anything with the canvas we need to import it into the javascript by using an id property.  We'll change the canvas element to include an id:</p>\n<p>{% highlight html %}\n<canvas id = \"turkey\" width = \"500\" height = \"500\">\nThanksgiving turkey goes here.\n</canvas>\n{% endhighlight %}</p>\n<p>We can then use this id to select the element in the Javascript code.  First we'll make a new function that we'll do our drawing in.  Inside this function we'll use <em>document.getElementById()</em> to select the canvas element. When we select the canvas we also need to get it's <em>graphics context</em>.  This is the object that allows us to draw shapes and other fun stuff on the canvas.  In order to call the function when the web page loads we'll add it to the body tag's onload property.  </p>\n<p>{% highlight javascript %}\nfunction draw(){\n//first we use the id property of the canvas element to get it\ncanvas = document.getElementById(\"turkey\");\nif(canvas.getContext){\n//the graphics context is what allows us to draw cool\n//things on the html5 canvas\nvar ctx = canvas.getContext(\"2d\");\n}\n}\n{% endhighlight %}</p>\n<p>{% highlight html %}</p>\n<body onload=\"draw()\">\n<canvas id = \"turkey\" width = \"500\" height = \"500\">\nThanksgiving turkey goes here.\n</canvas>\n</body>\n{% endhighlight %}\n<p>Now that we have our canvas imported and got it's graphics context we can start the fun part, drawing stuff!</p>\n<h1>Part 2 - Drawing</h1>\n<h2>Drawing the Body</h2>\n<p>Turkeys are large, bulbous birds.  Their shape is almost, spherical.  In our highly accurate two dimensional representation of this majestic land fowl we will be making it's body a circle.  </p>\n<p>Before we can draw the circle we need to set the fillStyle of the graphics context.  This variable allows us to the change the color of the insides of the shapes we draw.</p>\n<p>{% highlight js %}\nctx.fillStyle = \"rgb(127,108,56)\";\n{% endhighlight %}</p>\n<p>Now we'll draw the circle.  To do that we'll use the <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/CanvasRenderingContext2D/arc\">arc() function</a>.  After all, a circle is just a 360 degree angle arc right?  The function takes the angle in radians though, so we'll need to remember our high scshool algebra.  360 degrees is 2 PI in radians.  We'll draw our circle near the midde, setting it's center point at 100 x and 200 y.  We'll make the radius of the circle 50 so our turkey is nice and plump.  After we call arc() we need to call <strong>fill()</strong> to fill in the circle we drew with the color we specified in fillStyle earlier.  Here's what the code looks like:</p>\n<p>{% highlight js %}\n//once we set up our canvas and graphics context object we can start drawing!\n//first we'll draw the body of the turkey\nctx.fillStyle = \"rgb(127,108,56)\";\nvar x = 100; // x coordinate\nvar y = 200; // y coordinate\nvar radius = 50; // Arc radius\nvar startAngle = 0; // Starting point on circle\nvar endAngle = Math.PI * 2; // End point on circle\nvar anticlockwise = true; // clockwise or anticlockwise</p>\n<pre><code>//draw a circle by making a 360 degree arc\nctx.arc(x, y, radius, startAngle, endAngle, anticlockwise);\n\nctx.fill();\n</code></pre>\n<p>{% endhighlight %}</p>\n<p>And voila! We have a nice turkey body (almost as good as dad bod).</p>\n<p><img src=\"%7B%7Bsite.url%7D%7D/images/body.png\" alt=\"The body of the turkey\"></p>\n<h2>Drawing the feathers</h2>\n<p>Ok so we have a body, but what else to turkeys need? That's right, feathers!  </p>\n<p>We'll draw two lines and with a half circle as the tip for the feathers.  Drawing on the canvas is like drawing using a pen.  To start drawing \"freehand\" we call the <em>beginPath()</em> function.  First you need to move the pen using the <em>moveTo()</em> function.  This is like moving your hand that's holding the pen to a certain point on the canvas.  After we move the pen using moveTo we can use functions such as <em>arcTo()</em> and <em>lineTo()</em> to make \"marks\" on the canvas.  In order for the path we drew to appear though we need to call the <em>stroke()</em> or <em>fill()</em> functions.  The stroke() function makes the lines we drew appear on the canvas.  The fill() method fills in the shape our lines make with a certain color (specified by fillStyle!).  </p>\n<p><a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Canvas_API/Tutorial/Drawing_shapes\">Check out this quick Mozilla Development Center tutorial before you proceed!</a></p>\n<p>So how can we combine arcs and lines to make something that looks like a feather?  We want to use lines to draw the sides of the feather, then make an arc for the tip of our turkey's feather.  </p>\n<p>Our code looks something like this:</p>\n<p>{% highlight javascript %}\n//now lets draw a feather!\n//set the color to fill the feature\nctx.fillStyle = \"#B2130D\";\nctx.beginPath(); //we're going to draw a feather using a pen\nctx.moveTo(80, 180);\nctx.lineTo(60,80);\nctx.arc(50, 80, 10, 0, Math.PI, true);\nctx.lineTo(80,180);\nctx.fill();\n{% endhighlight %}</p>\n<p>So now we've drawn one feather.  But a turkey with one feather is one sad turkey!  Let's make some more! But since we're programmers, we like elegant solutions, so let's make a loop to make the other feathers.  </p>\n<p>We want the feathers to be different colors, so lets make an array of hexadecimal color codes (as strings) of the different colors we want for the feathers.  We can loop through this array and use fillStyle to make each feather a different color.  </p>\n<p>It would also be nice if the feathers were slightly rotated around the turkeys gorgeous bulbous body.  Transformations on the canvas are kinda weird.  They rotate the entire canvas.  So it's kinda like if you wanted to paint a diagonal line, you would rotate the canvas you were drawing on, then just draw a straight line on this rotated canvas.  The <em>rotate()</em> method rotates the canvas at a certain angle in radians (time to break out that high school trigonometry again!).  The <em>translate()</em> method move the canvas by a certain x and y amount.  We want to rotate our canvas a certain amount, then translate it a little bit, so our feathers rotate and move along the body as we draw them.  </p>\n<p>We should also talk about the <em>save()</em> and <em>restore()</em> functions.  Save() stores the current state of the canvas, it's good to call this before we do any wacky transformations.  Restore() brings back the state of the canvas that we had when we called the save() method.  These functions are useful for restoring the default state of the canvas after transformations.  </p>\n<p>Ok, so we have our colors for our feathers, we have the code to make our feathers, we know how rotating works, let's make our loop!</p>\n<p><img src=\"%7B%7Bsite.url%7D%7D/images/feathers.png\" alt=\"turkey with feathers\"></p>\n<p>{% highlight js %}</p>\n<pre><code>//we're gonna save the canvas state since we're moving it around\nctx.save();\n//now let's draw the next four using a loop\nfor(var i = 1; i &#x3C; 9; i++){\n    ctx.fillStyle = colors[i]; //choose the color for the feather\n    //rotate the feather to give it a cool effect\n    ctx.rotate((Math.PI/180)*(5));\n    ctx.translate(25,-5);\n    ctx.beginPath();\n    ctx.moveTo(80, 180);\n    ctx.lineTo(60,80);\n    ctx.arc(50, 80, 10, 0, Math.PI, true);\n    ctx.lineTo(80,180);\n    ctx.fill();\n}\n\n//restore the canvas state after all those wacky transformations\nctx.restore();\n</code></pre>\n<p>{% endhighlight %}</p>\n<h2>Drawing the Neck</h2>\n<p>When my cousin was very little she was very confused by turtleneck sweaters.  She would always get flustered and say, \"turtles have no necks!\".  Turkeys have necks though, so lets draw one.</p>\n<p>I did some fancy math using triangles and stuff to determine what coordinates and angles we need to use.  <em>Remember! All the angles in Javascript are in radians!</em>  We need to start around the midpoint of the turkey's body.  Doing some math with the radius and the center of the circle I chose this to be (65,185).  We move our pen to this area and start drawing.  Like our feathers, our neck and head will consist of two lines and a half circles (arc) at 45 degrees.  We'l also draw the gizzard a similar way, drawing a line straight down from the neck and then drawing a half circle (with a start angle of 180 degrees and and end angle of 180 degrees).</p>\n<p><img src=\"%7B%7Bsite.url%7D%7D/images/neck.png\" alt=\"turkey with neck\"></p>\n<p><strong>Now is a good time to talk about a weird thing with drawing paths.</strong>  Paths have <em>main paths</em> and <em>sub paths</em>.  Every time you use <em>moveTo()</em> you make a new subpath.  This can mess with the <em>fill()</em> function since it tries to automatically close the path (similar to the closePath() function).  It's best not to use moveTo() that often.  It's better to use moveTo() when you call beginPath() and then use lineTo() and other functions from there on out until the path is done.</p>\n<p>Here's the cool math and the code we used to make the neck (<em>warning: it uses lots of trigonometry</em>):</p>\n<p><img src=\"%7B%7Bsite.url%7D%7D/images/math.png\" alt=\"the cool math we use to make the neck\"></p>\n<p>{% highlight js %}\n//now let's draw the turkey's neck and eyes!\n//we're going to use two lines and arc\n//the arc is a Bezier curve\nctx.fillStyle = \"rgb(127,108,56)\";\nctx.beginPath();\n//we did some fancy trig to get these numbers\nctx.moveTo(65,185);\nctx.lineTo(34, 100);\n//let's make the head of the turkey an arc\nctx.save();\n//rotate the canvas\nvar k = Math.sin((Math.PI/180) * 45) <em>10; // the constant value we are using\nvar x = 34 - k;\nvar y = 100 + k;\nctx.arc(x, y, 10, (Math.PI/180)</em>-45, (Math.PI/180)*135, true);\n//now we draw the other line to finish the neck\nk = Math.sin((Math.PI/180) * 45) *20;\nctx.translate(-k,k); //use translate so the line is the same\n//do this little trick to get the right coordinates without calculating them\nctx.lineTo(65,185);\nctx.restore();</p>\n<pre><code>//fun fact, fill can automatically close the path!\nctx.fill();\n\n//now we will draw the gizzard \nctx.fillStyle = \"#B22003\";\nctx.beginPath();\nctx.moveTo(19,113);\nctx.lineTo(19,124);\nctx.arc(22,124,2.5, Math.PI, Math.PI*2, true);\nctx.fill();\n</code></pre>\n<p>{% endhighlight %}</p>\n<h2>The Beak</h2>\n<p>The beak is a very important part of the turkey.  It allows it to utter it's beautiful bird calls, also called \"the gobble\".  We're going to make our beak an orange triangle on the end of the head of our turkey.  We'll use to lines and then fill() to end the path automatically.  I started the path for the beak a little above where we made the part that goes under the neck.</p>\n<p><img src=\"%7B%7Bsite.url%7D%7D/images/eyes.png\" alt=\"turkey with a beak\"></p>\n<p>{% highlight js %}\n//let's draw the beak!\nctx.fillStyle = \"#FFDE00\";\nctx.beginPath();\nctx.moveTo(17,110);\nctx.lineTo(10,118);\nctx.lineTo(25,118);\nctx.fill();\n{% endhighlight %}</p>\n<h2>Look, Look with Your Special Eyes!</h2>\n<p>There is just one last thing we need to add to make our turkey complete.  Eyes!  This should be easy by now, it's just a circle in the middle of it's head!  </p>\n<p>{% highlight js %}\n//to finish it off let's draw the eyes!\nctx.fillStyle = \"#000000\";\nctx.beginPath();\nctx.arc(29,107,2,0,Math.PI*2,false);\nctx.fill();\n{% endhighlight %}</p>\n<p><strong>And with that we are finished! It's it beautiful?</strong></p>\n<p><img src=\"%7B%7Bsite.url%7D%7D/images/finished.png\" alt=\"the finished turkey\"></p>\n<p><em>You can see the finished code at</em> <a href=\"https://github.com/toastking/html5turkey\">github.com/toastking/html5turkey</a>! </p>\n<h1>What next?</h1>\n<ul>\n<li><a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Canvas_API/Tutorial/Basic_animations\">Animate it!</a></li>\n<li>Modify the program so it generates a random color for each feather instead of using the pre-made array in the loop.</li>\n<li><a href=\"http://www.createjs.com/\">Try out a javascript framework!</a></li>\n<li>Go eat some Thanksgiving Turkey! (and gravy!)</li>\n</ul>","frontmatter":{"title":"Make a Web 2.0 Turkey with HTML5 Canvas","date":null}}},"pageContext":{"slug":"/posts/2015-11-18-HTML5-Turkey/"}}