{"data":{"markdownRemark":{"html":"<h2>Texting, Email, Facebook messages, Tweets, all of our communication is asynchronous, like passing someone a note and hoping they pass it back.</h2>\n<p>There's a reason texting took off so rapidly as the <a href=\"http://www.away.gr/wp-content/uploads/2012/03/PIP_Teens_Smartphones_and_Texting.pdf\">main form of communication</a>.  It's discrete, you can text during a meeting or in a class much easier than taking a phone call.  Texting also feeds into the desire for immediacy that people crave.  A text is sent quickly and answered quickly.  Seeing the little speech bubble showing the other person typing gives us satisfaction-\"any minute know I'll have my answer\".  While texting is usually immediate it's also <em>asynchronous</em>.  Once we receive a message we can answer it at any time, it's not like a phone call where there's someone on the other line who will be insulted by the lack of an immediate answer.</p>\n<p>Read receipts and typing indicators give us a sense of real time communication, even if it's really not.  Though the disjointed nature of texting and messaging can also be one it's greatest advantages.  Someone can see if you read a message, but you can take as long as you want to answer.  You have time to craft the perfect response, whether it's to your crush or your boss. That extra time to answer can really help.  That's why texting is  more comfortable than a phone call or video chat, you have time to think.  </p>\n<p>I don't think all this asynchronous communication is a bad thing.  I think it helps people connect more face to face.  That's not necessarily what happens, we've all gone out to restaurants and seen tables of teenagers, heads' buried in their phones.  But I think if used correctly, texting is freeing.  Your phone isn't necessarily a shackle, in need of constant checking for new notifications.  I keep my phone on \"silent\" most of the time and only check it when I'm free.  I try not to look at it when I'm with people face to face.  This sometimes leads me to not answer messages for hours, which can frustrate my friends.  That's why texting is a godsend, it gives people the power to communicate with <em>who</em> they want <em>when</em> they want.</p>","frontmatter":{"title":"Asynchronous Communication","date":"2015-02-15"}}},"pageContext":{"slug":"/Asynchronous-Communication/2015-02-15-Asynchronous-Communication/"}}