{"data":{"markdownRemark":{"html":"<h1>SBCS Web Tutorial</h1>\n<p> In this tutorial we will be making a rotating photo gallery, similar to a digital picture frame.  We will be using the Flask framework, Python, jQuery, Bootstrap, and hosting our app on Microsoft's Azure cloud service.  </p>\n<p> Let's start at the beginning.</p>\n<h2>How the Web Works</h2>\n<p> Most connections on websites are transmitted using the Hypertext Transfer Protocol (HTTP). A    client sends HTTP <em>requests</em> to a server and the server responds with an HTTP <em>response</em>.  Flask is a python framework that allows us to write a web server to communicate with our client (the web browser) using HTTP.</p>\n<h2>Folder Setup</h2>\n<p> Flask is a very minimal framework so we have to set up our folders ourselves.\nThe folder setup is as follows:</p>\n<pre><code>    ./photoapp\n    ./templates\n      index.html\n    ./static\n      ./images\n      main.js\n      style.css\n    app.py\n</code></pre>\n<ul>\n<li>photoapp is the main folder for our project</li>\n<li>templates is where we store the Jinja templates that we will render using Flask</li>\n<li>static is where the css, javascript, and images are stored on the server</li>\n<li>app.py is our python file that will be used to run our server</li>\n</ul>\n<h2>Setting up virtualenv</h2>\n<p><strong>This part is very important!</strong></p>\n<p>Python uses a package manager called <em>pip</em>.  By default it installs all packaged globally, throughout your whole system.  We don't want every project to have every library though.\nWe use something called virtualenv to prevent this.  Virtualenv makes a sandbox for your project.  Anything installed stays in that project.</p>\n<p>To set it up follow the first part of the tutorial on the <a href=\"http://docs.python-guide.org/en/latest/dev/virtualenvs/\">virtualenv website</a>.</p>\n<p>After we have our virtual environment set up and activated we want to install the packages we want using <em>pip install</em> on the command line:</p>\n<pre><code>pip install flask\npip install gunicorn\n</code></pre>\n<p>Then we want to output the requirements of our project to a file called <em>requirements.txt</em>.  We're going to need it later for when we deploy our app to the cloud.</p>\n<pre><code>pip freeze > requirements.txt\n</code></pre>\n<h2>Setting up a Minimal Flask server</h2>\n<p>Flask is a <em>microframework</em>, it has very simple syntax.  The routing is based off making annotations with paths and then specifying the HTTP method you want to use (GET,POST,PUT,DELETE).</p>\n<p>Here's the code for our minimal Flask web app:</p>\n<pre><code class=\"language-python\">from flask import Flask #import the Flask library\n\napp = Flask(__name__) #set up our flask app using the name global\n\n#set up our root route (/)\n@app.route('/')\ndef home():\n  return \"Hello Flask!\"\n\n#set up the code to run our app from command line\nif __name__ == '__main__':\n  app.debug = True #set it to debug mode so the server reloads on code updates\n  app.run() #run our app\n</code></pre>\n<p>To run the app open up command line and change directory to the <strong>photoapp</strong> folder.  Then type <em>python app.py</em> and go to the localhost IP address in your web browser to see your work.  </p>\n<h2>Rendering a real HTML page</h2>\n<p>The minimal server is all fine and dandy, it prints hello world in our browser.  We want to do more though, we want to use Flask to give us customized web pages.  To do that we'll have to make an Jinja template.  A Jinja template is an html file with code or variables from our server inserted into it between curly braces (\"{{ }}\").  On the backend code (our Flask server) we call the <em>render_template()</em> method to turn our template into a static html page that the browser can understand.</p>\n<p>So, let's make an html page, called index.html since it's our homepage, and put it in the <em>./static</em> folder of our app.  Make a basic page and then insert a variable called <strong>name</strong> into the page between curly braces:</p>\n<pre><code class=\"language-html\">&#x3C;!doctype html>\n&#x3C;head>\n&#x3C;title>PhotoApp&#x3C;/title>\n&#x3C;/head>\n&#x3C;body>\n{% if name %}\n&#x3C;h1>&#x3C;span id = \"greeting\">Hello&#x3C;/span> {{name}}...&#x3C;/h1>\n{% else %}\n&#x3C;h1>Hello...&#x3C;/h1>\n{% endif %}\n&#x3C;/body>\n</code></pre>\n<p>See how I surrounded the variable part with a conditional?  Jinja is a very powerful templating language and it allows for conditionals, loops, etc.  I added the conditional to have a fallback case incase the backend doesn't supply the variable properly for some reason.</p>\n<p>Now let's add the code on the backend to render our template:</p>\n<ul>\n<li>First change our <em>import</em> statement to also load the render_template library</li>\n<li>Then add a variable for the <em>name</em> (I called mine name)</li>\n<li>Lastly change your home() method to return <em>render_template('index.html', name = name)</em></li>\n</ul>\n<p>So here's what your code should look like now:</p>\n<pre><code class=\"language-python\">from flask import Flask,render_template #import the Flask library\n\napp = Flask(__name__) #set up our flask app using the name global\nname = \"Matt\" #our name variable\n#set up our root route (/)\n@app.route('/')\ndef home():\n  return render_template('index.html', name = name)\n\n#set up the code to run our app from command line\nif __name__ == '__main__':\n  app.debug = True #set it to debug mode so the server reloads on code updates\n  app.run() #run our app\n</code></pre>\n<p>Now when you run the app it should render the name you specified in the backend file.</p>\n<h2>Adding the images</h2>\n<p>This is the largest section of our project.  We're going to add the images to our images folder on the backend server. We're going to add another route to the backend to load and return the paths to image files. Then we're going to add jQuery code to the front end to poll our server and get images at a refresh rate of 5s.</p>\n<h3>Adding images to the folder</h3>\n<p>Download some images from the internet, I prefer using cats as placeholder images.  You can also use images from <a href=\"https://placehold.it/\">placehold.it</a>.  Place the images in the ./static/images folder of your project.  This is because the images are static resources, they don't change.</p>\n<h3>Add the images to index.html</h3>\n<p>We're going to load the images by querying the server using jQuery to get the paths to our images.  We're going to add an image to our index.html file and then assign the <em>src</em> attribute dynamically using Javascript.</p>\n<h3>Load the filepaths to the images on the backend</h3>\n<p>Using the <em>os</em> module in Python we can get information about the computer's filesystem.  In this case we're going to use it to get the filepaths of all our images in the <em>./static/images</em> folder on our web server.  </p>\n<p>-First <strong>import os</strong> at the top of the app.py file\n-Then we're going to create an array called imagepaths to hold our the image paths as strings\n-Also create a variable for the baseurl of our image folder path to make things easier later on\n-Inside of the conditional at the end of the file (the one where app.run is called), add code to loop through all the files in the images folder. Use <strong>os.listdir(imagefolderpath)</strong>, you can use file.endswith(\".jpg\") to see if it's the right file type.</p>\n<p>Here's what our code looks like now:</p>\n<pre><code class=\"language-python\">from flask import Flask,render_template #import the Flask library\nimport os\n\napp = Flask(__name__) #set up our flask app using the name global\nname = \"Matt\" #our name variable\nimagepaths = [] #image paths\nbase_img_path = \"./static/images/\"\n\n#set up our root route (/)\n@app.route('/')\ndef home():\n  return render_template('index.html', name = name)\n\n#set up the code to run our app from command line\nif __name__ == '__main__':\n  #use a python list  comprehension to build our array of file paths\n  imagepaths = [img for img in os.listdir(base_img_path) if img.endswith(\".jpeg\") or img.endswith(\".jpg\") or img.endswith(\".png\")]\n\n  app.debug = True #set it to debug mode so the server reloads on code updates\n  app.run() #run our app\n</code></pre>\n<h3>Return a random image from the array</h3>\n<p>To make our photos change we're going to make a route in our app to return a random image path from the image list we just made. (In Python we call arrays <em>lists</em> because we're cool like that) To do that we're going to do the following:</p>\n<ul>\n<li><strong>import random</strong> at the top of the code, we're going to use the random.choice(list) method to return a random list item</li>\n<li>Next, create a new route for '/image' in our app.  This will return a random image url when the frontend queries our backend.</li>\n<li>Inside of the method for the image route we will return a random url by returning <strong>random.choice(imagepaths)</strong></li>\n</ul>\n<p>Here's what our new route looks like:</p>\n<pre><code class=\"language-python\">@app.route('/image')\ndef random_image():\n    print base_img_path+random.choice(imagepaths)\n    #return a random image url\n    return base_img_path + random.choice(imagepaths)\n</code></pre>\n<h3>Get the image url on the frontend</h3>\n<p>Now it's time to dive into some jQuery!  We're going to add a file called <em>main.js</em> to our static folder.  Then we're going to add the jQuery library to our project.  Inside main.js we'll write our jQuery code poll the backend and add the image. <a href=\"https://en.wikipedia.org/wiki/Polling_(computer_science)\">Polling</a> is an efficient way of running an operation periodically.</p>\n<ul>\n<li>Make the main.js file inside your ./static folder</li>\n<li>Add the jQuery library to the <em><head></em> part of index.html by getting the script tag from the <a href=\"https://developers.google.com/speed/libraries/\">Google CDN</a></li>\n<li>Inside your main.js initialize your jQuery to run on <em>document.load()</em></li>\n<li>Then get the image using the $(\"#slide\")</li>\n<li>Use <a href=\"http://stackoverflow.com/questions/6835835/jquery-simple-polling-example\"><em>setTimeout()</em></a> and <a href=\"http://learn.jquery.com/ajax/\"><em>.ajax</em></a> functions to poll the /image route on our backend.</li>\n<li>Once you get the image url use <em>.attr('src',response)</em> to set the image src for the image on our index.html.</li>\n</ul>\n<p>Here's what our main.js looks like:</p>\n<pre><code class=\"language-javascript\">//use the shorthand for document ready\n$(function(){\n  console.log(\"document loaded!\");\n\n  var slideImage = $(\"#slide\"); //get the image\n\n//make the ajax request to the server to get the image urls\n(function poll(){\n  //poll for data with a 6 second timout\n    $.ajax({\n        url:\"/image\",\n        type:\"GET\",\n        dataType:\"text\",\n        success: function(text){\n          console.log(text);\n          slideImage.attr(\"src\",text);\n        },\n        complete: setTimeout(poll, 6000),\n        timeout: 2000\n      });\n})();\n});\n</code></pre>\n<h2>Uploading the Project to the Cloud</h2>\n<p>Now we want to deploy our app to the cloud so other people can look at it and see how cool we are.  We're going to use Heroku because it's easy to connect with Github.</p>\n<p>You can see the tutorial for deploying Python apps to Heroku on the <a href=\"https://devcenter.heroku.com/articles/getting-started-with-python#introduction\">their website</a></p>\n<p>We have our requirements.txt from earlier in the project.  Now we need to make a Procfile.  </p>\n<p>The Procfile tells the gunicorn web server how to run our app the Heroku VM (aka the cloud).</p>\n<p>Here's what our procfile should look like (if you named your main file app.py):</p>\n<pre><code>web: gunicorn app:app --log-file=-\n</code></pre>\n<p>Then we can deploy our app by connecting heroku to our <a href=\"https://devcenter.heroku.com/articles/github-integration\">github project</a> or by using the <a href=\"https://devcenter.heroku.com/articles/getting-started-with-python#deploy-the-app\">heroku toolbelt</a>.</p>","frontmatter":{"title":"SBCS Flask Tutorial","date":"February 25, 2016"}}},"pageContext":{"slug":"/Flask-tutorial/2016-02-25-Flask-Tutorial/"}}